* Dotfiles

This repository contains all my public configuration files. I manage
the dotfiles with [[https://www.gnu.org/software/stow/][GNU Stow]].

My computers run Debian with Guix. Non-Free software, I get through
flatpak.

Configuration containing sensitive information is in a separate
private dotfiles repository. It includes configuration for:

#+begin_src shell :results list :exports results
  ls ~/dotfiles_private
#+end_src

#+RESULTS:
- aspell
- authinfo
- aws
- bin
- credentials
- garminDb
- git
- gnupg
- hunspell_dictionary
- offlineimap
- procmail
- ruby
- sourceme
- ssh
- voice_vault

** Install Non-Free software

#+begin_src shell :exports code
  flatpak install -y flathub com.spotify.Client
  flatpak install -y flathub us.zoom.Zoom
  flatpak install -y flathub com.slack.Slack
  flatpak install -y flathub org.signal.Signal
  flatpak install -y flathub com.google.Chrome
  flatpak install -y flathub com.obsproject.Studio
#+end_src


** Git LFS Required

This repository uses [[https://git-lfs.com][Git Large File Storage (LFS)]] to manage large
binaries (e.g., =deno=, =hugo=, AppImages, etc.).

To properly check out these files:

1. *Install Git LFS* (if you haven’t already):

   #+begin_src shell
   git lfs install
   #+end_src

2. *Clone the repo normally*—LFS hooks will auto-fetch large files:

   #+begin_src shell
   git clone https://github.com/munen/dotfiles.git
   #+end_src
